#### IExtElemChangeBeamSection Members

---

|  |
| --- |
| IExtElemChangeBeamSection Interface   Methods   See Also |

The  IExtElemChangeBeamSection  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | ChangeSection | The method that will be called when user wants to change beam section |

# See Also

IExtElemChangeBeamSection Interface

Autodesk.Revit.DB.Structure Namespace